---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidResourceName(System.String)
source: html/d9deaa7c-6b96-6fad-6f16-426df57e09e7.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidResourceName Method

Checks whether the resource name is valid.

## Syntax (C#)
```csharp
public bool IsValidResourceName(
	string resourceName
)
```

## Parameters
- **resourceName** (`System.String`) - The resource name to check.

## Returns
True if the name is a valid resource name, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null